[
    {
        "value":  [
                      "{\r\n    \"@odata.type\":  \"#microsoft.graph.windowsUpdateForBusinessConfiguration\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"supportsScopeTags\":  false,\r\n    \"deviceManagementApplicabilityRuleOsEdition\":  null,\r\n    \"deviceManagementApplicabilityRuleOsVersion\":  null,\r\n    \"deviceManagementApplicabilityRuleDeviceMode\":  null,\r\n    \"description\":  \"Windows Update for Business Configuration for the Broad Ring\",\r\n    \"displayName\":  \"Modern Workplace Update Policy [Broad]-[Windows Autopatch]-restore-27-02-2023-10-50-36\",\r\n    \"deliveryOptimizationMode\":  \"userDefined\",\r\n    \"prereleaseFeatures\":  \"userDefined\",\r\n    \"automaticUpdateMode\":  \"windowsDefault\",\r\n    \"microsoftUpdateServiceAllowed\":  true,\r\n    \"driversExcluded\":  false,\r\n    \"qualityUpdatesDeferralPeriodInDays\":  9,\r\n    \"featureUpdatesDeferralPeriodInDays\":  0,\r\n    \"qualityUpdatesPaused\":  false,\r\n    \"featureUpdatesPaused\":  false,\r\n    \"qualityUpdatesPauseExpiryDateTime\":  \"0001-01-01T00:00:00Z\",\r\n    \"featureUpdatesPauseExpiryDateTime\":  \"0001-01-01T00:00:00Z\",\r\n    \"businessReadyUpdatesOnly\":  \"all\",\r\n    \"skipChecksBeforeRestart\":  false,\r\n    \"updateWeeks\":  null,\r\n    \"qualityUpdatesPauseStartDate\":  null,\r\n    \"featureUpdatesPauseStartDate\":  null,\r\n    \"featureUpdatesRollbackWindowInDays\":  30,\r\n    \"qualityUpdatesWillBeRolledBack\":  null,\r\n    \"featureUpdatesWillBeRolledBack\":  null,\r\n    \"qualityUpdatesRollbackStartDateTime\":  \"0001-01-01T00:00:00Z\",\r\n    \"featureUpdatesRollbackStartDateTime\":  \"0001-01-01T00:00:00Z\",\r\n    \"engagedRestartDeadlineInDays\":  null,\r\n    \"engagedRestartSnoozeScheduleInDays\":  null,\r\n    \"engagedRestartTransitionScheduleInDays\":  null,\r\n    \"deadlineForFeatureUpdatesInDays\":  5,\r\n    \"deadlineForQualityUpdatesInDays\":  5,\r\n    \"deadlineGracePeriodInDays\":  2,\r\n    \"postponeRebootUntilAfterDeadline\":  false,\r\n    \"autoRestartNotificationDismissal\":  \"notConfigured\",\r\n    \"scheduleRestartWarningInHours\":  null,\r\n    \"scheduleImminentRestartWarningInMinutes\":  null,\r\n    \"userPauseAccess\":  \"disabled\",\r\n    \"userWindowsUpdateScanAccess\":  \"notConfigured\",\r\n    \"updateNotificationLevel\":  \"notConfigured\",\r\n    \"allowWindows11Upgrade\":  false,\r\n    \"installationSchedule\":  {\r\n                                 \"@odata.type\":  \"#microsoft.graph.windowsUpdateScheduledInstall\",\r\n                                 \"scheduledInstallDay\":  \"everyday\",\r\n                                 \"scheduledInstallTime\":  \"03:00:00.0000000\"\r\n                             }\r\n}",
                      "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations",
                      "Modern Workplace Update Policy [Broad]-[Windows Autopatch]",
                      "eb381f2e-2e5f-4118-9386-d57410d70529"
                  ],
        "Count":  4
    },
    {
        "value":  [
                      "{\r\n    \"@odata.type\":  \"#microsoft.graph.windowsUpdateForBusinessConfiguration\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"supportsScopeTags\":  false,\r\n    \"deviceManagementApplicabilityRuleOsEdition\":  null,\r\n    \"deviceManagementApplicabilityRuleOsVersion\":  null,\r\n    \"deviceManagementApplicabilityRuleDeviceMode\":  null,\r\n    \"description\":  \"Windows Update for Business Configuration for the Fast Ring\",\r\n    \"displayName\":  \"Modern Workplace Update Policy [Fast]-[Windows Autopatch]-restore-27-02-2023-10-50-37\",\r\n    \"deliveryOptimizationMode\":  \"userDefined\",\r\n    \"prereleaseFeatures\":  \"userDefined\",\r\n    \"automaticUpdateMode\":  \"windowsDefault\",\r\n    \"microsoftUpdateServiceAllowed\":  true,\r\n    \"driversExcluded\":  false,\r\n    \"qualityUpdatesDeferralPeriodInDays\":  6,\r\n    \"featureUpdatesDeferralPeriodInDays\":  0,\r\n    \"qualityUpdatesPaused\":  false,\r\n    \"featureUpdatesPaused\":  false,\r\n    \"qualityUpdatesPauseExpiryDateTime\":  \"0001-01-01T00:00:00Z\",\r\n    \"featureUpdatesPauseExpiryDateTime\":  \"0001-01-01T00:00:00Z\",\r\n    \"businessReadyUpdatesOnly\":  \"all\",\r\n    \"skipChecksBeforeRestart\":  false,\r\n    \"updateWeeks\":  null,\r\n    \"qualityUpdatesPauseStartDate\":  null,\r\n    \"featureUpdatesPauseStartDate\":  null,\r\n    \"featureUpdatesRollbackWindowInDays\":  30,\r\n    \"qualityUpdatesWillBeRolledBack\":  null,\r\n    \"featureUpdatesWillBeRolledBack\":  null,\r\n    \"qualityUpdatesRollbackStartDateTime\":  \"0001-01-01T00:00:00Z\",\r\n    \"featureUpdatesRollbackStartDateTime\":  \"0001-01-01T00:00:00Z\",\r\n    \"engagedRestartDeadlineInDays\":  null,\r\n    \"engagedRestartSnoozeScheduleInDays\":  null,\r\n    \"engagedRestartTransitionScheduleInDays\":  null,\r\n    \"deadlineForFeatureUpdatesInDays\":  5,\r\n    \"deadlineForQualityUpdatesInDays\":  2,\r\n    \"deadlineGracePeriodInDays\":  2,\r\n    \"postponeRebootUntilAfterDeadline\":  false,\r\n    \"autoRestartNotificationDismissal\":  \"notConfigured\",\r\n    \"scheduleRestartWarningInHours\":  null,\r\n    \"scheduleImminentRestartWarningInMinutes\":  null,\r\n    \"userPauseAccess\":  \"disabled\",\r\n    \"userWindowsUpdateScanAccess\":  \"notConfigured\",\r\n    \"updateNotificationLevel\":  \"notConfigured\",\r\n    \"allowWindows11Upgrade\":  false,\r\n    \"installationSchedule\":  {\r\n                                 \"@odata.type\":  \"#microsoft.graph.windowsUpdateScheduledInstall\",\r\n                                 \"scheduledInstallDay\":  \"everyday\",\r\n                                 \"scheduledInstallTime\":  \"03:00:00.0000000\"\r\n                             }\r\n}",
                      "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations",
                      "Modern Workplace Update Policy [Fast]-[Windows Autopatch]",
                      "44896236-b5a8-4119-b935-9fd5e3f667e5"
                  ],
        "Count":  4
    },
    {
        "value":  [
                      "{\r\n    \"@odata.type\":  \"#microsoft.graph.windowsUpdateForBusinessConfiguration\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"supportsScopeTags\":  false,\r\n    \"deviceManagementApplicabilityRuleOsEdition\":  null,\r\n    \"deviceManagementApplicabilityRuleOsVersion\":  null,\r\n    \"deviceManagementApplicabilityRuleDeviceMode\":  null,\r\n    \"description\":  \"Windows Update for Business Configuration for the First Ring\",\r\n    \"displayName\":  \"Modern Workplace Update Policy [First]-[Windows Autopatch]-restore-27-02-2023-10-50-37\",\r\n    \"deliveryOptimizationMode\":  \"userDefined\",\r\n    \"prereleaseFeatures\":  \"userDefined\",\r\n    \"automaticUpdateMode\":  \"windowsDefault\",\r\n    \"microsoftUpdateServiceAllowed\":  true,\r\n    \"driversExcluded\":  false,\r\n    \"qualityUpdatesDeferralPeriodInDays\":  1,\r\n    \"featureUpdatesDeferralPeriodInDays\":  0,\r\n    \"qualityUpdatesPaused\":  false,\r\n    \"featureUpdatesPaused\":  false,\r\n    \"qualityUpdatesPauseExpiryDateTime\":  \"0001-01-01T00:00:00Z\",\r\n    \"featureUpdatesPauseExpiryDateTime\":  \"0001-01-01T00:00:00Z\",\r\n    \"businessReadyUpdatesOnly\":  \"all\",\r\n    \"skipChecksBeforeRestart\":  false,\r\n    \"updateWeeks\":  null,\r\n    \"qualityUpdatesPauseStartDate\":  null,\r\n    \"featureUpdatesPauseStartDate\":  null,\r\n    \"featureUpdatesRollbackWindowInDays\":  30,\r\n    \"qualityUpdatesWillBeRolledBack\":  null,\r\n    \"featureUpdatesWillBeRolledBack\":  null,\r\n    \"qualityUpdatesRollbackStartDateTime\":  \"0001-01-01T00:00:00Z\",\r\n    \"featureUpdatesRollbackStartDateTime\":  \"0001-01-01T00:00:00Z\",\r\n    \"engagedRestartDeadlineInDays\":  null,\r\n    \"engagedRestartSnoozeScheduleInDays\":  null,\r\n    \"engagedRestartTransitionScheduleInDays\":  null,\r\n    \"deadlineForFeatureUpdatesInDays\":  5,\r\n    \"deadlineForQualityUpdatesInDays\":  2,\r\n    \"deadlineGracePeriodInDays\":  2,\r\n    \"postponeRebootUntilAfterDeadline\":  false,\r\n    \"autoRestartNotificationDismissal\":  \"notConfigured\",\r\n    \"scheduleRestartWarningInHours\":  null,\r\n    \"scheduleImminentRestartWarningInMinutes\":  null,\r\n    \"userPauseAccess\":  \"disabled\",\r\n    \"userWindowsUpdateScanAccess\":  \"notConfigured\",\r\n    \"updateNotificationLevel\":  \"notConfigured\",\r\n    \"allowWindows11Upgrade\":  false,\r\n    \"installationSchedule\":  {\r\n                                 \"@odata.type\":  \"#microsoft.graph.windowsUpdateScheduledInstall\",\r\n                                 \"scheduledInstallDay\":  \"everyday\",\r\n                                 \"scheduledInstallTime\":  \"03:00:00.0000000\"\r\n                             }\r\n}",
                      "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations",
                      "Modern Workplace Update Policy [First]-[Windows Autopatch]",
                      "d114c701-70bd-4674-aae8-ca3dc9f9b25a"
                  ],
        "Count":  4
    },
    {
        "value":  [
                      "{\r\n    \"@odata.type\":  \"#microsoft.graph.windowsUpdateForBusinessConfiguration\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"supportsScopeTags\":  false,\r\n    \"deviceManagementApplicabilityRuleOsEdition\":  null,\r\n    \"deviceManagementApplicabilityRuleOsVersion\":  null,\r\n    \"deviceManagementApplicabilityRuleDeviceMode\":  null,\r\n    \"description\":  \"Windows Update for Business Configuration for the Test Ring\",\r\n    \"displayName\":  \"Modern Workplace Update Policy [Test]-[Windows Autopatch]-restore-27-02-2023-10-50-38\",\r\n    \"deliveryOptimizationMode\":  \"userDefined\",\r\n    \"prereleaseFeatures\":  \"userDefined\",\r\n    \"automaticUpdateMode\":  \"windowsDefault\",\r\n    \"microsoftUpdateServiceAllowed\":  true,\r\n    \"driversExcluded\":  false,\r\n    \"qualityUpdatesDeferralPeriodInDays\":  0,\r\n    \"featureUpdatesDeferralPeriodInDays\":  0,\r\n    \"qualityUpdatesPaused\":  false,\r\n    \"featureUpdatesPaused\":  false,\r\n    \"qualityUpdatesPauseExpiryDateTime\":  \"0001-01-01T00:00:00Z\",\r\n    \"featureUpdatesPauseExpiryDateTime\":  \"0001-01-01T00:00:00Z\",\r\n    \"businessReadyUpdatesOnly\":  \"all\",\r\n    \"skipChecksBeforeRestart\":  false,\r\n    \"updateWeeks\":  null,\r\n    \"qualityUpdatesPauseStartDate\":  null,\r\n    \"featureUpdatesPauseStartDate\":  null,\r\n    \"featureUpdatesRollbackWindowInDays\":  30,\r\n    \"qualityUpdatesWillBeRolledBack\":  null,\r\n    \"featureUpdatesWillBeRolledBack\":  null,\r\n    \"qualityUpdatesRollbackStartDateTime\":  \"0001-01-01T00:00:00Z\",\r\n    \"featureUpdatesRollbackStartDateTime\":  \"0001-01-01T00:00:00Z\",\r\n    \"engagedRestartDeadlineInDays\":  null,\r\n    \"engagedRestartSnoozeScheduleInDays\":  null,\r\n    \"engagedRestartTransitionScheduleInDays\":  null,\r\n    \"deadlineForFeatureUpdatesInDays\":  5,\r\n    \"deadlineForQualityUpdatesInDays\":  0,\r\n    \"deadlineGracePeriodInDays\":  0,\r\n    \"postponeRebootUntilAfterDeadline\":  false,\r\n    \"autoRestartNotificationDismissal\":  \"notConfigured\",\r\n    \"scheduleRestartWarningInHours\":  null,\r\n    \"scheduleImminentRestartWarningInMinutes\":  null,\r\n    \"userPauseAccess\":  \"disabled\",\r\n    \"userWindowsUpdateScanAccess\":  \"notConfigured\",\r\n    \"updateNotificationLevel\":  \"notConfigured\",\r\n    \"allowWindows11Upgrade\":  false,\r\n    \"installationSchedule\":  {\r\n                                 \"@odata.type\":  \"#microsoft.graph.windowsUpdateScheduledInstall\",\r\n                                 \"scheduledInstallDay\":  \"everyday\",\r\n                                 \"scheduledInstallTime\":  \"03:00:00.0000000\"\r\n                             }\r\n}",
                      "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations",
                      "Modern Workplace Update Policy [Test]-[Windows Autopatch]",
                      "b2672540-f1ee-4679-ba40-bb3d686c62f2"
                  ],
        "Count":  4
    }
]